/*
*********************************************************************************************************
*
*	模块名称 : 通用函数模块
*	文件名称 : common.c
*	版    本 : V1.0
*	说    明 : 
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2016-04-2 方川  正式发布
*
*	Copyright (C), 2015-2020, 阿波罗科技 www.apollorobot.com
*
*********************************************************************************************************
*/
#include "common.h"
#include "bsp_uart_fifo.h"
/*
*********************************************************************************************************
*	函 数 名: issafe
*	功能说明: 判断一个值是否在安全范围内
*	形    参:  无
*	返 回 值: 0:安全   -1:不安全
*********************************************************************************************************
*/
int issafe(int value, int min, int max)
{
    int val = value;	 
	  if(val < min || val > max)
			return -1;
	  else
			return 0;
}
/*
*********************************************************************************************************
*	函 数 名: constrain_180
*	功能说明: 将误差角度限制在0--180°范围内
*	形    参:  无
*	返 回 值: 限制值
*********************************************************************************************************
*/
float constrain_180(float error_angle)
{
	    float value;
	    
	    if(error_angle < -180)
			{
				value = error_angle + 360;
				return value;
			}
			if(error_angle > 180)
			{
				value = error_angle - 360;
				return value;
			}
			else
				return error_angle;
	   
}

/*
*********************************************************************************************************
*	函 数 名: update_DCM
*	功能说明: 更新方向余弦矩阵
*	形    参: angle:绕Z轴旋转的欧拉角
*	返 回 值: 
*********************************************************************************************************
*/
void update_DCM(float angle, Matrix3f* m)
{
	    float cos_angle = cos(angle);
      float	sin_angle = sin(angle);

	    m->a.x = cos_angle;
	    m->a.y = - sin_angle;
	    m->a.z = 0;
	
	    m->b.x = sin_angle;
	    m->b.y = cos_angle;
	    m->b.z = 0;
	 
	    m->c.x = 0;
	    m->c.y = 0;
	    m->c.z = 1;
	   
}

/*
*********************************************************************************************************
*	函 数 名: update_DCM_T
*	功能说明: 更新方向余弦矩阵的逆，即他的转置
*	形    参: angle:绕Z轴旋转的欧拉角
*	返 回 值: 
*********************************************************************************************************
*/
void update_DCM_T(float angle, Matrix3f* m)
{
	    float cos_angle = cos(angle);
      float	sin_angle = sin(angle);

	    m->a.x = cos_angle;
	    m->a.y = sin_angle;
	    m->a.z = 0;
	
	    m->b.x = -sin_angle;
	    m->b.y = cos_angle;
	    m->b.z = 0;
	 
	    m->c.x = 0;
	    m->c.y = 0;
	    m->c.z = 1;
	   
}

/*
*********************************************************************************************************
*	函 数 名: DCM_Multiply_Position
*	功能说明: 位置向量左乘方向余弦矩阵
*	形    参: p:旧的位置向量，         m:方向余弦矩阵
*	返 回 值: 指向新Position结构体
*********************************************************************************************************
*/
Position DCM_Multiply_Position(Position* p, Matrix3f* m)
{
	
      Position  new_p;
	 
	    new_p.x = m->a.x * p->x + m->a.y * p->y + m->a.z * p->z;
	    new_p.y = m->b.x * p->x + m->b.y * p->y + m->b.z * p->z;
	    new_p.z = m->c.x * p->x + m->c.y * p->y + m->c.z * p->z;

	    return new_p;
	   
}

/*
*********************************************************************************************************
*	函 数 名: update_Jacobi
*	功能说明: 更新雅可比矩阵
*	形    参: a1:臀关节角度   a2:膝关节角度    a3:踝关节角度
*	返 回 值: 
*********************************************************************************************************
*/
void update_Jacobi(float a1, float a2,  float a3, Matrix3f* m)
{
	    float c1,s1;
      float	c2,s2;
	    float c23, s23;
	   
	    c1 = cos(a1); s1 = sin(a1);
	    c2 = cos(a2); s2 = sin(a2);
	    c23 = cos(a2 + a3);
	    s23 = sin(a2 + a3);

	    m->a.x = -L3_Length*s1*c23 - L2_Length*s1*c2 - L1_Length*s1;
	    m->a.y = -L3_Length*c1*s23 - L2_Length*c1*s2;
	    m->a.z = -L3_Length*c1*s23;
	
	    m->b.x = L3_Length*c1*c23 + L2_Length*c1*c2 + L1_Length*c1;
	    m->b.y = -L3_Length*s1*s23 - L2_Length*s1*s2;
	    m->b.z = -L3_Length*s1*s23;
	 
	    m->c.x = 0;
	    m->c.y = -L3_Length*s23 - L2_Length*c2;
	    m->c.z = -L3_Length*c23;
	   
}
/*
*********************************************************************************************************
*	函 数 名: init_task_fifo
*	功能说明: 初始化任务队列
*	形    参: 
*	返 回 值: 
*********************************************************************************************************
*/
void init_task_fifo(_Task* task)
{
	  task->front = 0;
	  task->rear = 0;
	  task->size = 0;
}
/*
*********************************************************************************************************
*	函 数 名: is_fifo_empty
*	功能说明: 判断队列是否为空
*	形    参:
*	返 回 值: 
*********************************************************************************************************
*/
static int is_fifo_empty(_Task* task)
{
	  if(task->front == task->rear )
			 return FIFO_EMPTY;
		else
			return  NO_ERR;
}
/*
*********************************************************************************************************
*	函 数 名: is_fifo_full
*	功能说明: 判断队列是否为满
*	形    参: 
*	返 回 值: 
*********************************************************************************************************
*/
static int is_fifo_full(_Task* task)
{
	  if((task->rear + 1 )%FIFO_MAX_SIZE == task->front )
			return FIFO_FULL;
		else 
			return NO_ERR;
}
/*
*********************************************************************************************************
*	函 数 名: fifo_put_task
*	功能说明: 任务入队列
*	形    参: 
*	返 回 值: 
*********************************************************************************************************
*/
int fifo_put_task(_Task*task, _Order order)
{
	  if(is_fifo_full(task) == FIFO_FULL)
		{
			 printf("TASK FIFO is full!\n");
			 return FIFO_FULL;
		}
	  task->rear = (task->rear + 1)%FIFO_MAX_SIZE;
		task->task_array[task->rear] = order;
		task->size ++;
		
		return NO_ERR;
}
/*
*********************************************************************************************************
*	函 数 名: fifo_get_task
*	功能说明: 任务出队列
*	形    参: 
*	返 回 值: 
*********************************************************************************************************
*/
int fifo_get_task(_Task* task, _Order* current_order)
{
	  if(is_fifo_empty(task) == FIFO_EMPTY)
		{		
			  printf("TASK FIFO is empty!\n");
				return FIFO_EMPTY;
		}
		task->front = (task->front + 1)%FIFO_MAX_SIZE;
		*current_order = task->task_array[task->front];
		task->size --;
		
		return NO_ERR;
}
/***************************** 阿波罗科技 www.apollorobot.com (END OF FILE) *********************************/
